MIRYHANG/stm32f103-balance-car/Core/Src/pwm.c
//
// Created by YZH on 2026/8/11.
//
#include "pwm.h"
#include "tim.h"
#include "stm32f1xx_hal_tim.h"

void PWM_Init(void)
{
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 0);
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 0);
}

void PWM_SetCompare1(uint16_t compare)
{
    uint32_t max_compare = __HAL_TIM_GET_AUTORELOAD(&htim2) + 1U;
    if (max_compare > UINT16_MAX)
    {
        max_compare = UINT16_MAX;
    }
    if ((uint32_t)compare > max_compare)
    {
        compare = (uint16_t)max_compare;
    }
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, compare);
}

void PWM_SetCompare2(uint16_t compare)
{
    uint32_t max_compare = __HAL_TIM_GET_AUTORELOAD(&htim2) + 1U;
    if (max_compare > UINT16_MAX)
    {
        max_compare = UINT16_MAX;
    }
    if ((uint32_t)compare > max_compare)
    {
        compare = (uint16_t)max_compare;
    }
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, compare);
}
